{
  "backend/main.mo": "Motoko canister implementing marketplace data models, access control, and CRUD-style queries for products, shops, categories, reviews, custom orders, wishlists, favorites, and user profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of key frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark theme CSS variables.",
  "frontend/index.html": "HTML entrypoint loading the React app root and main.tsx module.",
  "frontend/src/App.tsx": "Main React app setup including routing, theme provider, authentication check, and profile‑setup handling.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches rendering errors and shows a reload prompt.",
  "frontend/src/components/BackendErrorNotice.tsx": "Reusable component displaying backend call errors with optional retry button.",
  "frontend/src/components/CategoryCard.tsx": "UI card linking to a category page using category id and name.",
  "frontend/src/components/CustomOrderButton.tsx": "Button and dialog enabling authenticated users to submit custom order requests to a shop.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright info and Caffeine.ai attribution with dynamic hostname tracking.",
  "frontend/src/components/Header.tsx": "Header component that handles login/logout via Internet Identity and displays navigation links including conditional wishlist access.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, tags, price, and optional wishlist removal functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name using a profile creation mutation.",
  "frontend/src/components/ReviewSection.tsx": "Displays product reviews, average rating, and a form for authenticated users to submit new reviews.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating products, categories, reviews, wishlist items, and user profiles via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/CategoryPage.tsx": "Displays products filtered by selected category with loading, error, and empty states.",
  "frontend/src/pages/HomePage.tsx": "Shows hero, categories, featured products, and featured shops with loading and error handling.",
  "frontend/src/pages/ProductDetailPage.tsx": "Renders detailed product info, shop link, reviews, wishlist actions, and image handling.",
  "frontend/src/pages/ShopPage.tsx": "Displays a shop’s info, announcements, and its products with error and loading states.",
  "frontend/src/pages/WishlistPage.tsx": "Shows the user’s wishlist, requiring login and supporting loading and error conditions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, features, issues, and metadata for a handmade marketplace build plan."
}